#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
module.practices_app_service.module.practices_app_service_autoscaler.data.azurerm_linux_web_app.this[0]: Still reading... [10s elapsed]
module.licences_app_service.module.licences_app_service_autoscaler.data.azurerm_linux_web_app.this[0]: Still reading... [10s elapsed]
module.payments_app_service.module.payments_app_service_autoscaler.data.azurerm_linux_web_app.this[0]: Still reading... [10s elapsed]
module.vehicles_app_service.module.vehicles_app_service_autoscaler.data.azurerm_linux_web_app.this[0]: Still reading... [10s elapsed]
module.practices_app_service.module.practices_app_service_autoscaler.data.azurerm_linux_web_app.this[0]: Still reading... [20s elapsed]
module.licences_app_service.module.licences_app_service_autoscaler.data.azurerm_linux_web_app.this[0]: Still reading... [20s elapsed]
module.payments_app_service.module.payments_app_service_autoscaler.data.azurerm_linux_web_app.this[0]: Still reading... [20s elapsed]
module.vehicles_app_service.module.vehicles_app_service_autoscaler.data.azurerm_linux_web_app.this[0]: Still reading... [20s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.key_vault.azurerm_role_assignment.apim_kv_secrets_read must be replaced
-/+ resource "azurerm_role_assignment" "apim_kv_secrets_read" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-ipatente-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-ipatente-kv-01/providers/Microsoft.Authorization/roleAssignments/7fadd110-d211-5ef2-2f3c-a71352f70160" -> (known after apply)
      ~ name                                   = "7fadd110-d211-5ef2-2f3c-a71352f70160" -> (known after apply)
      ~ principal_id                           = "5622ec45-ad97-46ae-b2c0-035ad01f70b2" -> "bef9fb72-7a41-44d1-9819-2f0b5020bad6" # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
